Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The Swift language defines the postfix ! as syntactic sugar for the named type Optional<Wrapped>, which is defined in the Swift standard library, with the additional behavior that it’s automatically unwrapped when it’s accessed.
ja: スウィフト言語は、接尾辞!を糖衣構文としてスウィフト標準ライブラリで定義される名前付きの型Optional<Wrapped>に対して定義します、それはそれがアクセスされるとき自動的にアンラップされるという追加の挙動を含みます。

source: The Swift language defines the postfix ? as syntactic sugar for the named type Optional<Wrapped>, which is defined in the Swift standard library.
ja: スウィフト言語は、接尾辞?を糖衣構文として名前付きの型Optional<Wrapped>に対して定義します、それは、スウィフト標準ライブラリで定義されます。

source: The Swift language is relatively small, because many common types, functions, and operators that appear virtually everywhere in Swift code are actually defined in the Swift standard library.
ja: スウィフト言語は比較的小さいです、スウィフトのコードのほとんど至る所で見かける多くの通常の型、関数、そして演算子がスウィフト標準ライブラリで実際には定義されるからです。

source: The Swift language provides the following syntactic sugar for the Swift standard library Array<Element> type:
ja: スウィフト言語は、スウィフト標準ライブラリのArray<Element>型のために以下の糖衣構文を提供します：

source: The Swift language provides the following syntactic sugar for the Swift standard library Dictionary<Key, Value> type:
ja: スウィフト言語は、以下の糖衣構文をスウィフト標準ライブラリDictionary<Key, Value>型に提供します：

source: The Swift logical operators && and || are left-associative, meaning that compound expressions with multiple logical operators evaluate the leftmost subexpression first.
ja: スウィフトの論理演算子&&と||は、左結合です、複数の論理演算子を持つ複合式が最も左の下位の式を最初に評価することを意味しています。

source: The Swift standard library also defines a Float type, which represents a 32-bit floating-point number.
ja: スウィフト標準ライブラリはまたFloat型も定義します、それは、32ビットの浮動小数点数を表します。

source: The Swift standard library also defines types for various sizes of signed and unsigned integers, as described in Integers.
ja: 整数で記述されるように、スウィフト標準ライブラリはまた、さまざまな大きさの符号つきおよび符号なし整数のために、いろいろな型を定義します。

source: The Swift standard library defines a number of operators for your use, many of which are discussed in Basic Operators and Advanced Operators.
ja: スウィフト標準ライブラリは、いくつかの演算子をあなたが使うために定義します、その多くは基本の演算子と先進の演算子で記述されます。

source: The Swift standard library defines a protocol called Equatable, which requires any conforming type to implement the equal to operator (==) and the not equal to operator (!=) to compare any two values of that type.
ja: スウィフト標準ライブラリは、Equatableと呼ばれるプロトコルを定義します、それは、それに準拠している全ての型に対してその型のあらゆる２つの値を比較するために同等演算子（==）と不等演算子（!=）を実装することを要求します。

source: The Swift standard library includes tuple comparison operators for tuples with fewer than seven elements.
ja: スウィフト標準ライブラリは、いくらかのタプル比較演算子を、７要素より少数でのタプルに対して含んでいます。

source: The above example uses a defer statement to ensure that the open(_:) function has a corresponding call to close(_:).
ja: 上の例は、defer文を使って、open(_:)関数がそれと対応するclose(_:)への呼び出しを持つことを確実にします。

source: The access control level of a type also affects the default access level of that type’s members (its properties, methods, initializers, and subscripts).
ja: ある型のアクセス制御水準はまた、その型のメンバー（それのプロパティ、メソッド、イニシャライザ、そして添え字）の省略時のアクセス水準に影響を与えます。

source: The access level for a function type is calculated as the most restrictive access level of the function’s parameter types and return type.
ja: 関数型のためのアクセス水準は、その関数のパラメータ型と戻り型での最も制限の多いアクセス水準と同じに算出されます。

source: The access level for a generic type or generic function is the minimum of the access level of the generic type or function itself and the access level of any type constraints on its type parameters.
ja: 総称体型または総称体関数のためのアクセス水準は、総称体型または関数自身のアクセス水準およびその型パラメータ上のあらゆる型制約のアクセス水準の最少のものです。

source: The access level for a tuple type is the most restrictive access level of all types used in that tuple.
ja: タプル型のためのアクセス水準は、そのタプルで使われる全ての型での最も制限的なアクセス水準です。

source: The access level of a nested type is the same as its containing type, unless the containing type is public.
ja: 入れ子にされた型のアクセス水準は、それの容れ物である型と同じです、容れ物である型が公開である場合を除いて。

source: The access level of each requirement within a protocol definition is automatically set to the same access level as the protocol.
ja: プロトコル定義内の各要件のアクセス水準は、自動的にプロトコルと同じアクセス水準に設定されます。

source: The actual type to use for that associated type isn’t specified until the protocol is adopted.
ja: その関連型のために使われる実際の型は、プロトコルが採用されるまでは指定されません。

source: The actual type to use in place of T is determined each time the swapTwoValues(_:_:) function is called.
ja: Tの代わりに実際に使われる型は、swapTwoValues(_:_:)関数が呼ばれるたびに決定されます。

source: The addition operator is also supported for String concatenation:
ja: 加算演算子は、また、String連結に対してもサポートされます：

source: The additional capabilities that classes support come at the cost of increased complexity.
ja: クラスがサポートする追加の能力は、複雑さの増加という犠牲を伴います。

source: The appropriate choice of weak or unowned depends on the relationships between the different parts of your code.
ja: 弱いまたは非所有の適切な選択は、あなたのコードの異なる部分間の関係に依存します。

source: The appropriate floating-point type to use depends on the nature and range of values you need to work with in your code.
ja: 使うのに適切な浮動小数点型は、あなたのコードにおいて扱わなければならない値の種別と幅に依ります。

source: The appropriate form to use depends on the scope at which the variable is declared and the kind of variable you intend to declare.
ja: 使用するのに適切な形式は、その変数が宣言されるスコープとあなたが宣言するつもりである変数の種類に依存します。

source: The argument for the canImport() platform condition is the name of a module that may not be present on all platforms.
ja: canImport()プラットホーム条件に対する引数は、全てのプラットホームには含まれないかもしれないあるモジュールの名前です。

source: The argument is automatically converted to a closure, because the customerProvider parameter’s type is marked with the @autoclosure attribute.
ja: 引数は、自動的にクロージャに変換されます、なぜならcustomerProviderパラメータの型は@autoclosure属性で印されるからです。

source: The argument label is used when calling the function; each argument is written in the function call with its argument label before it.
ja: 引数ラベルは、関数を呼び出すときに使われます；各引数は、関数呼び出しにおいてそれの前のそれの引数ラベルとともに書かれます。

source: The argument to the objc attribute can also change the runtime name for that declaration.
ja: objc属性に対する引数はまた、その宣言に対するランタイム名を変更できます。

source: The argument value passed to this parameter specifies how much runningTotal should be incremented by each time the returned incrementer function is called.
ja: このパラメータに渡された引き数の値は、返されたインクリメンタ関数（漸増器関数）が呼ばれるたびに、どのくらいrunningTotalが増やされなければならないかについて指定します。

source: The arguments to the initializer are passed like a function call when you create an instance of the class.
ja: イニシャライザに対する引数は、あなたがクラスのインスタンスをつくるときに関数呼び出しのように渡されます。

source: The arithmetic addition operator is a binary operator because it operates on two targets and is said to be infix because it appears in between those two targets.
ja: 算術加算演算子は、それが２つの目標に作用するので二項演算子です、そして、それがそれらの２つの目標の間に現れるので接中辞と言われます。

source: The array [16, 58, 510] is used to create the new array ["OneSix", "FiveEight", "FiveOneZero"]:
ja: 配列[16, 58, 510]は、新しい配列["OneSix", "FiveEight", "FiveOneZero"]をつくるために使われます：

source: The array is declared outside the scope of the function, which means the closures in the array can be executed after the function returns.
ja: この配列は関数のスコープの外側で宣言されます、それは配列の中のクロージャが関数が戻った後で実行されることができるのを意味します。

source: The assignment is part of the optional chaining, which means none of the code on the right-hand side of the = operator is evaluated.
ja: この代入はオプショナル連鎖の一部です、それが意味するのは、=演算子の右手側で評価されるコードは何もないということです。

source: The assignment operator (=) doesn’t return a value, to prevent it from being mistakenly used when the equal to operator (==) is intended.
ja: 代入演算子（=）は値を返しません、同等演算子（==）が意図される時にそれが誤って使われるのを防ぐためです。

source: The assignment operator does not return any value.
ja: 代入演算子は、少しの値も返しません。

source: The audio channels described above are represented by instances of the AudioChannel structure:
ja: 上で記述される音声のチャンネルは、AudioChannel構造体のインスタンスによって表されます：

source: The author of a property wrapper type is responsible for determining the meaning of its projected value and defining the interface that the projected value exposes.
ja: プロパティラッパー型の作者は、その予測値の意味の決定にそして予測値を露出するインターフェイスの定義に責任があります。

source: The availability condition above specifies that in iOS, the body of the if statement executes only in iOS 10 and later; in macOS, only in macOS 10.12 and later.
ja: 上の有効性条件が指定するのは、iOS上では、ifの本文はiOS 10以降でのみ；macOS上では、macOS 10.12以降でのみ実行することです。

source: The availability condition takes a comma-separated list of platform names and versions.
ja: 有効性条件は、プラットホーム名とバージョンのコンマ区切りのリストを取ります。

source: The backticks aren’t considered part of the identifier; `x` and x have the same meaning.
ja: バッククォートは、識別子の一部とみなされません；`x`とxは、同じ意味を持ちます。

source: The barcode example in Associated Values shows how cases of an enumeration can declare that they store associated values of different types.
ja: 関連値におけるバーコード例は、それらが異なる型の関連値を格納することを、ある列挙のケース節たちがどのように宣言可能かを示します。

source: The base class in the hierarchy is called Food, which is a simple class to encapsulate the name of a foodstuff.
ja: この階層構造における基盤クラスはFoodと呼ばれています、それは、食品の名前をカプセル化する単純なクラスです。

source: The basic characteristic of an ASCII art shape is a draw() function that returns the string representation of that shape, which you can use as the requirement for the Shape protocol:
ja: あるASCIIアート形状の基本的な特徴は、その形状の文字列表現を返すdraw()関数です、それはあなたが要件としてShapeプロトコルに対して使用できます：

source: The basic form imports the entire module; it consists of the import keyword followed by a module name:
ja: 基本の形式は、そのモジュール全体をインポートします；それは、importキーワードとそれに続くモジュール名から成ります：

source: The basic syntax for type constraints on a generic function is shown below (although the syntax is the same for generic types):
ja: 総称体関数に関する型制約のための基本の構文は、下で示されます（とはいえ構文は総称体型と同じものです）：

source: The behavior of x as! T is the same as the behavior of (x as? T)!.
ja: x as! Tの挙動は、(x as? T)!の挙動と同じです。

source: The behavior you see in your code is always as if a copy took place immediately.
ja: あなたがあなたのコードで見るこの挙動は、常にまるである１つのコピーが直ちに生じたかのようです。

source: The bit-shifting behavior for unsigned integers is as follows:
ja: 符号なし整数のためのビットシフト挙動は、次の通りです：

source: The bitwise AND operator combines them to make the number 00111100, which is equal to an unsigned decimal value of 60:
ja: ビット単位の論理積演算子は、それらを結合して、数00111100をつくります、それは、符号なしの10進数の60と等しいです：

source: The bitwise NOT operator is a prefix operator, and appears immediately before the value it operates on, without any white space:
ja: ビット単位の論理否定演算子は、接頭辞演算子で、少しの空白なしで、それが作用する値の直前に現れまます：

source: The bitwise NOT operator is then used to create a new constant called invertedBits, which is equal to initialBits, but with all of the bits inverted.
ja: ビット単位の論理否定演算子は、それからinvertedBitsと呼ばれる新しい定数をつくるために使われます、それは、initialBitsと等しいです、しかし全てのビットは逆にされます。

source: The bitwise OR operator combines them to make the number 11111110, which equals an unsigned decimal of 254:
ja: ビット単位の論理和演算子は、それらを結合して、数11111110を作ります、それは、符号なしの10進数の254と等しいです：

source: The bitwise XOR operator sets both of these bits to 1 in its output value.
ja: ビット単位の排他的論理和演算子は、これらのビットの両方ともその出力値において1に設定します。

source: The board has 25 squares, and the aim is to land on or beyond square 25.
ja: この盤には25の正方形があります、そして目ざすのは正方形25の上に乗るまたは越える事です。

source: The body of a class contains zero or more declarations.
ja: クラスの本文は、０個以上の宣言を含みます。

source: The body of a protocol contains zero or more protocol member declarations, which describe the conformance requirements that any type adopting the protocol must fulfill.
ja: プロトコルの本文は０以上のプロトコルメンバー宣言を含みます、それは、プロトコルを採用しているすべての型が満たさなければならない準拠要件を記述します。

source: The body of a structure contains zero or more declarations.
ja: 構造の本文は、０以上の宣言を含みます。

source: The body of an enumeration declared using either form contains zero or more values—called enumeration cases—and any number of declarations, including computed properties, instance methods, type methods, initializers, type aliases, and even other enumeration, structure, and class declarations.
ja: どちらの形式を使って宣言される列挙宣言の本文でも、０以上の値 ― 列挙ケース節と呼ばれるもの ― および任意の数の宣言から成っていて、計算プロパティ、インスタンスメソッド、型メソッド、イニシャライザ、型エイリアス、そして他の列挙、構造体、およびクラス宣言さえも含められます。

source: The body of an extension declaration contains zero or more declarations.
ja: 拡張宣言の本文は、０個以上の宣言を含みます。

source: The body of each case must contain at least one executable statement.
ja: それぞれのケース節の本文は、少なくとも１つの実行可能な文を含んでいることが必要です。

source: The body of the greet(person:) function starts by defining a new String constant called greeting and setting it to a simple greeting message.
ja: greet(person:)関数の本文は、greetingと呼ばれる新しいString定数を定義してそれを単純な挨拶メッセージに設定することによって始まります。

source: The body of the minMax(array:) function starts by setting two working variables called currentMin and currentMax to the value of the first integer in the array.
ja: minMax(array:)の本文は、currentMinとcurrentMaxと呼ばれる２つの作業用の変数を配列の最初の整数に設定することによって始まります。

source: The body of the swapTwoValues(_:_:) function is identical to the body of the swapTwoInts(_:_:) function.
ja: swapTwoValues(_:_:)関数の本文は、swapTwoInts(_:_:)関数の本文と同一です。

source: The brackets tell Swift that T is a placeholder type name within the swapTwoValues(_:_:) function definition.
ja: この括弧は、TがswapTwoValues(_:_:)関数定義内のプレースホルダ型名であるとスウィフトに教えます。

source: The call in the following example doesn’t compile because there isn’t an implementation of dynamicallyCall(withArguments:) that takes KeyValuePairs<String, String>.
ja: 以下の例における呼び出しはコンパイルしません、なぜならdynamicallyCall(withArguments:)の実装でKeyValuePairs<String, String>をとるものがないからです。

source: The call to increment(forCount:) happens only if increment(forCount:) exists—that is, if it isn’t nil.
ja: increment(forCount:)への呼び出しは、increment(forCount:)が存在する場合にのみ起こります ― すなわち、それがnilでない場合。

source: The call to the digitNames dictionary’s subscript is followed by an exclamation point (!), because dictionary subscripts return an optional value to indicate that the dictionary lookup can fail if the key does not exist.
ja: digitNames辞書への呼び出しの添え字の後に感嘆符（!）が続きます、なぜなら、キーが存在しない場合は辞書検索が失敗し得ることを意味するために、辞書添え字がオプショナルの値を返すからです。

source: The call-as-function methods and the methods from the dynamicCallable attribute make different trade-offs between how much information you encode into the type system and how much dynamic behavior is possible at runtime.
ja: call-as-functionメソッドとdynamicCallable属性からのメソッドは、どのくらいの情報をあなたが型システムにエンコードするかそしてどのくらい動的挙動が実行時に可能かの間で、異なる取り引きを行います。

source: The calling code can use any type that conforms to the Comparable protocol.
ja: 呼び出しているコードは、Comparableプロトコルに準拠するあらゆる型を使用できます。

source: The capabilities described above for computing and observing properties are also available to global variables and local variables.
ja: 計算するそして監視するプロパティに対して上で記述される可能なことは、また、グローバル変数とローカル変数に対して利用できます。

source: The case values of an enumeration are actual values, not just another way of writing their raw values.
ja: ある列挙に属するケース節の値は実際の値です、単にそれらの生の値を別のやり方で書くことではありません。

source: The chapter’s example of Overriding Property Getters and Setters has been rewritten to show how to override a description property.
ja: この章のプロパティゲッターとセッターのオーバーライドの例は書き直されて、descriptionプロパティをオーバーライドする方法を示します。

source: The characters are visually similar, but don’t have the same linguistic meaning:
ja: これらの文字は視覚的には同じ形です、しかし同じ言語的意味を持ちません：

source: The class also defines a deinitializer, which prints a message to show when an HTMLElement instance is deallocated.
ja: クラスもデイニシャライザを定義します、それは、HTMLElementインスタンスが割り当て解除される場合に示すメッセージを出力します。

source: The class instance is not fully valid until the first phase ends.
ja: 第１段階が終わるまで、クラスインスタンスは充分に有効ではありません。

source: The class is assumed to take a nontrivial amount of time to initialize.
ja: （このクラスは、瑣末でない量の時間が初期化にかかると仮定されます。）

source: The closed range operator has an alternative form for ranges that continue as far as possible in one direction—for example, a range that includes all the elements of an array from index 2 to the end of the array.
ja: 完結範囲演算子は、一方向に可能な限り続く範囲 — 例えば、インデックス２から配列の最後までの配列のすべての要素を含む範囲、などに対する代替の形式を持ちます。

source: The closed range operator is useful when iterating over a range in which you want all of the values to be used, such as with a for-in loop:
ja: 完結範囲演算子は、あなたがその値の全てが使われることを望む、ある範囲全体に渡って繰り返すときに役に立ちます、例えばfor-inループで：

source: The closure can be used to create a string representation of any integer greater than zero.
ja: このクロージャは、ゼロより大きいあらゆる整数の文字列表現を作るために使われることが出来ます。

source: The closure can then refer to and modify the values of those constants and variables from within its body, even if the original scope that defined the constants and variables no longer exists.
ja: クロージャはそれから、その本文内からそれらの定数と変数の値に言及することや修正することができます、たとえその定数と変数を定義した本来のスコープがもはや存在しないとしてもです。

source: The closure expression also specifies a return type of String, to indicate the type that will be stored in the mapped output array.
ja: クロージャ式はまた、Stringの戻り型を指定します、それによってマップされた出力配列の中に格納されることになる型を指し示します。

source: The closure expression builds a string called output each time it is called.
ja: クロージャ式は、それが呼ばれるたびに、outputと呼ばれる文字列をつくります。

source: The closure expression examples below illustrate these optimizations by refining a single example of the sorted(by:) method over several iterations, each of which expresses the same functionality in a more succinct way.
ja: 以下のクロージャ式の例は、これらの最適化を１つの例のsorted(by:)メソッドの改良をいくどか繰り返していくことで解説します、そして、そのそれぞれは同じ機能性をより簡潔な方法で表わします。

source: The closure expression examples below use the sorted(by:) method to sort an array of String values in reverse alphabetical order.
ja: 下のクロージャ式の例は、sorted(by:)メソッドを使用してString値からなる配列を逆アルファベット順に分類します。

source: The closure expressions passed to myFunction in code above are examples of this kind of immediate use.
ja: 上のコードにおいてmyFunctionに渡されるクロージャ式は、この種の直接的な利用の例です。

source: The closure in the example above calculates and sets the appropriate color for each square on the board in a temporary array called temporaryBoard, and returns this temporary array as the closure’s return value once its setup is complete.
ja: 上の例でのクロージャはtemporaryBoardと呼ばれる一時的な配列の中の板上の各正方形に対して適切な色を計算して設定します、そしてひとたびその準備が完了されるならば、この一時的な配列をクロージャの戻り値として返します。

source: The closure is called once for each item in the array, and returns an alternative mapped value (possibly of some other type) for that item.
ja: クロージャは、配列の中の各項目に対して一度だけ呼ばれて、その項目のための代わりの対応付けされた（おそらく何か他の型の）値を返します。

source: The code above calls the continue keyword whenever it matches a vowel or a space, causing the current iteration of the loop to end immediately and to jump straight to the start of the next iteration.
ja: 上のコードは、それが母音または空白と合致するたびにcontinueキーワードを呼んで、ループの現在の繰り返しを直ちに終わって、次の繰り返しのスタートへまっすぐポンと飛ぶようにします。

source: The code above creates a dictionary of mappings between the integer digits and English-language versions of their names.
ja: 上のコードは、整数桁とそれらの名前の英語版の間で対応付けをする辞書を作成します。

source: The code above creates a new Counter instance; sets its data source to be a new ThreeSource instance; and calls the counter’s increment() method four times.
ja: 上のコードは、新しいCounterインスタンスをつくり；それのデータ・ソースを新しいThreeSourceインスタンスであるように設定します；そして、counterのincrement()メソッドを４回呼び出します。

source: The code above succeeds when john.residence has a non-nil value and will set roomCount to an Int value containing the appropriate number of rooms.
ja: john.residenceが非nil値を持って、roomCountを部屋の適当な数を含んでいるInt値に設定するとき、上のコードは成功します。

source: The code above uses the ternary conditional operator and forced unwrapping (a!) to access the value wrapped inside a when a is not nil, and to return b otherwise.
ja: 上のコードは、三項条件演算子と強制アンラップ（a!）を使って、aがnilでないならばa内部にラップされた値にアクセスします、それ以外ではbを返します。

source: The code below adds a projectedValue property to the SmallNumber structure to keep track of whether the property wrapper adjusted the new value for the property before storing that new value.
ja: 下のコードは、projectedValueプロパティをSmallNumber構造体に加えることで、プロパティラッパーがプロパティに対する新しい値を、その新しい値を格納する前に調節したかどうかを追跡します。

source: The code below shows four examples of these special characters.
ja: 以下のコードは、これらの特殊文字の４つの例を示します。

source: The code below shows how a closure delays evaluation.
ja: 下のコードは、どのようにクロージャが評価を遅らすかを示します。

source: The code below shows that the same error appears for overlapping write accesses to the properties of a structure that’s stored in a global variable.
ja: 下のコードは、グローバル変数に格納される構造体に属するプロパティに対するオーバーラップする書き込みアクセスに、同じエラーが起こることを示します。

source: The code below shows the ArithmeticExpression recursive enumeration being created for (5 + 4) * 2:
ja: 以下のコードは、(5 + 4) * 2に対して作成されている再帰列挙ArithmeticExpressionを示します：

source: The code in a closure has access to things like variables and functions that were available in the scope where the closure was created, even if the closure is in a different scope when it is executed—you saw an example of this already with nested functions.
ja: あるクロージャの中のコードは、そのクロージャが作成されたところのスコープ内で利用可能だった変数や関数といったものにアクセスをします、たとえそのクロージャが実行されるときに異なるスコープの中にあってもです ― あなたはこの例を入れ子にされた関数で既に見ました。

source: The code in the examples above sets the initial value for the wrapped property by giving number an initial value in the definition of TwelveOrLess.
ja: 上の例におけるコードは、ラップされたプロパティに初期値を設定することを、numberを初期値に与えることによって、TwelveOrLessの定義の中で、行います。

source: The code in the following example refers to the projected value of the wrapper around height and width as $height and $width:
ja: 次の例におけるコードは、heightとwidthのまわりのラッパーの予測値を、$heightと$widthとして参照します：

source: The code inside makeTrapezoid() can return any type it needs to, as long as that type conforms to the Shape protocol, like the calling code does for a generic function.
ja: makeTrapezoid()内部のコードは、それが必要とするどんな型でも返すことが、その型がShapeプロトコルに準拠する限りは可能です、呼び出しているコードが総称体関数に対してするように。

source: The code inside that initializer sets the initial wrapped value and the initial maximum value, using the default values of zero and 12.
ja: そのイニシャライザの内側のコードは、初期ラップ値と初期最大値を設定します、ゼロと12の省略時の値を使って。

source: The code inside the function is written in a general way so it can handle whatever type the caller provides.
ja: 関数の内側のコードは、ある一般化された方法で記述されます、それでそれは呼び出し側が提供するどんな型でも取り扱うことができます。

source: The code inside the module could build up the same shape in a variety of ways, and other code outside the module that uses the shape shouldn’t have to account for the implementation details about the list of transformations.
ja: モジュール内のコードは、同じ形状をさまざまな方法で作り上げることができました、そしてその形状を使うモジュール外のその他のコードは、ずらっとある変形それらについての実装詳細に関知する必要はないはずです。

source: The code is executed regardless of whether the function throws an error.
ja: そのコードは、関数がエラーをスローするかどうかに関係なく実行されます。

source: The code snippets below define four model classes for use in several subsequent examples, including examples of multilevel optional chaining.
ja: 下のコード切れっぱしは、複数階層のオプショナル連鎖の例を含む以降のいくつかの例のために、４つのモデル・クラスを定義します。

source: The code that calls max(_:_:) chooses the values for x and y, and the type of those values determines the concrete type of T.
ja: max(_:_:)を呼び出すコードは、xとyに対して値を選びます、そしてそれらの値の型はTの具象型を決定します。

source: The code that calls the function needs to be written in a general way, like the implementation of a generic function, so that it can work with any Shape value that’s returned by makeTrapezoid().
ja: 関数を呼び出すコードは、ある一般的な方法で書かれることを必要とします、総称体関数の実装のように、それでそれは、makeTrapezoid()によって返されるあらゆるShapeと仕事できます。

source: The code within a default case is executed only if no other cases match the control expression.
ja: 他のいかなるケース節も制御式にマッチしない場合だけ、省略時のケース節内のコードは実行されます。

source: The code you provide is run any time the value changes outside of an initializer.
ja: あなたが提供したコードは、その値がイニシャライザの外側で変化する時はいつでも実行されます。

source: The colon in the declaration means “…of type…,” so the code above can be read as:
ja: 宣言でのコロンは「…の型の…」を意味します、それで上のコードは次のように読まれることができます：

source: The column number in which it begins.
ja: それが開始するコラム番号。

source: The compiler also detects methods with override that don’t actually override any method in the superclass.
ja: コンパイラはまた、実際にはスーパークラスにおけるメソッドを少しもオーバーライドしないoverrideをもつメソッドも検出します。

source: The compiler assumes that preconditions are always true, and it optimizes your code accordingly.
ja: コンパイラは、その前提条件が常にtrueであるとみなします、そしてそれはあなたのコードをそれを受けて最適化します。
